; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v1 - type_3 ?v3 - type_2)
 	      (pred_4 ?v4 - object ?v3 - type_2)
	      (pred_2 ?v1 - type_3 ?v2 - type_1)
	      (pred_3 ?v1 - type_3 ?v4 - object ?v2 - type_1))

   (:action op_1
       :parameters  (?v1 - type_3 ?v6 ?v8 - type_2)
       :precondition (and  (pred_1 ?v1 ?v6))
       :effect (and  (pred_1 ?v1 ?v8)
		     (not (pred_1 ?v1 ?v6))))

   (:action op_3
       :parameters (?v1 - type_3 ?v5 - object ?v7 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_4 ?v5 ?v7) (pred_1 ?v1 ?v7) (pred_2 ?v1 ?v2))
       :effect (and (pred_3 ?v1 ?v5 ?v2)
		    (not (pred_4 ?v5 ?v7)) 
		    (not (pred_2 ?v1 ?v2))))

   (:action op_2
       :parameters (?v1 - type_3 ?v5 - object ?v7 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v1 ?v5 ?v2) (pred_1 ?v1 ?v7))
       :effect (and (pred_4 ?v5 ?v7)
		    (pred_2 ?v1 ?v2)
		    (not (pred_3 ?v1 ?v5 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_10 obj_07 - type_3
obj_11 obj_02 obj_12 obj_01 - type_1
obj_08 obj_03 obj_06 - type_2
obj_04 obj_05 obj_09 - object)
(:init
(pred_1 obj_10 obj_08)
(pred_2 obj_10 obj_11)
(pred_2 obj_10 obj_02)
(pred_1 obj_07 obj_06)
(pred_2 obj_07 obj_12)
(pred_2 obj_07 obj_01)
(pred_4 obj_04 obj_08)
(pred_4 obj_05 obj_03)
(pred_4 obj_09 obj_08)
)
(:goal
(and
(pred_4 obj_04 obj_03)
(pred_4 obj_05 obj_06)
(pred_4 obj_09 obj_03)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_10 obj_03) (pred_1 obj_07 obj_03))))
  )
)
)

; plan
1. (op_3 obj_10 obj_04 obj_08 obj_02)
   deleted: (pred_4 obj_04 obj_08) (pred_2 obj_10 obj_02)
   added: (pred_3 obj_10 obj_04 obj_02)
   goals met: 0 of 3
2. (op_3 obj_10 obj_09 obj_08 obj_11)
   deleted: (pred_4 obj_09 obj_08) (pred_2 obj_10 obj_11)
   added: (pred_3 obj_10 obj_09 obj_11)
   goals met: 0 of 3
3. (op_1 obj_10 obj_08 obj_03)
   deleted: (pred_1 obj_10 obj_08)
   added: (pred_1 obj_10 obj_03)
   goals met: 0 of 3
4. (op_2 obj_10 obj_04 obj_03 obj_02)
   deleted: (pred_3 obj_10 obj_04 obj_02)
   added: (pred_4 obj_04 obj_03) (pred_2 obj_10 obj_02)
   goals met: 1 of 3
5. (op_2 obj_10 obj_09 obj_03 obj_11)
   deleted: (pred_3 obj_10 obj_09 obj_11)
   added: (pred_4 obj_09 obj_03) (pred_2 obj_10 obj_11)
   goals met: 2 of 3
6. (op_3 obj_10 obj_05 obj_03 obj_02)
   deleted: (pred_4 obj_05 obj_03) (pred_2 obj_10 obj_02)
   added: (pred_3 obj_10 obj_05 obj_02)
   goals met: 2 of 3
7. (op_1 obj_10 obj_03 obj_06)
   deleted: (pred_1 obj_10 obj_03)
   added: (pred_1 obj_10 obj_06)
   goals met: 2 of 3
8. (op_2 obj_10 obj_05 obj_06 obj_02)
   deleted: (pred_3 obj_10 obj_05 obj_02)
   added: (pred_4 obj_05 obj_06) (pred_2 obj_10 obj_02)
   goals met: 3 of 3
